# Delete Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAnyHandle..::..Delete Method
IFCAnyHandle Class See Also
---
Deletes the handle.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void Delete()
```

Visual Basic
---
```text
Public Sub Delete
```

Visual C++
---
```text
public:
void Delete()
```

# See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace